app/controllers/apiv1/categories_controller.rb

    def index
      categories = Category.all
---
SELECT "categories".* FROM "categories"