app/controllers/apiv1/products_controller.rb

SELECT "products".* FROM "products"
---
    def index
      products = Product.all

INSERT INTO "products" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-10-30 03:22:30.589279"], ["updated_at", "2014-10-30 03:22:30.589279"]]
---
    def create
      product = Product.new(product_params)
      if product.save

UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = 6  [["name", "Cheap Gem"], ["updated_at", "2014-10-30 21:42:49.316447"]]
---
    def update
      if @product.update_attributes(product_params)

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
---
    def find_product
      @product = Product.find(params[:id])